data_text='''귀난국산02 남위마두03 해죽봄공04 밀더이말05 옷값농넋06 잔모학방07 댁금들힘08 겁효간야09 시성컵짐10 병빛새그11 소서등차12 점날개읍13 키깨징수14 앞잠손돌15 무표유넷16 논눈밤검17 자길예놀18 글코십한19 용숯얼포20 겉오쥐의21 다강또섬22 뜰외파은23 피장너때24 상대맛사25 네육끼집26 벌미틀배27 추솔나솜28 만벼곳화29 죄담운절30 일처덤뇌31 구강주귤32 삼띠침여33 도전억칼34 알늘후씨35 꽃양당돈36 연회매엿37 달겹신꿀38 혀인뼈막39 녹답낫비40 김노교궁41 약불발단42 덕목저요43 조계굴빵44 군실꾀늪45 잎애살옥46 폐널님재47 꿈안왕탈48 터쑥곰기49 샘종면멋50 능음열우01'''
data = data_text.split(' ')
data = [el[:-2] for el in data]

for i, d in enumerate(data):
    for j in range(4):
        with open('text_{0:02d}_{1:04d}.txt'.format(j+1, i+1), 'w') as f:
            f.write(d[j])
